# SQL for Data Analysis  
## Intermediate Workshop
*D‚ÄëLab, UC¬†Berkeley*

<div class="alert alert-success"> 
<b>Prerequisites for SQL Intermediate Workshop</b><br><br>
Completion of "SQL for Data Analysis: Introductory Workshop" or equivalent experience:
<ul>
<li>Understanding of basic SQL syntax including SELECT, FROM, WHERE, GROUP BY</li>
<li>Familiarity with basic data filtering and sorting in SQL</li>
<li>Experience with simple aggregations (COUNT, SUM, AVG)</li>
</ul>
    
These prerequisites ensure participants have the foundational knowledge needed to succeed in learning the more advanced concepts like JOINs, subqueries, CTEs, and window functions covered in the second workshop.
</div>

## Table of Contents
1. [Introduction](#introduction)
2. [Relational Joins](#joins)
3. [Subqueries](#subqueries)
4. [Common Table Expressions (CTEs)](#ctes)
5. [Pivoting and Unpivoting](#pivot)
6. [Window Functions](#window)
7. [Key Points](#keypoints)

<div class="alert alert-success"> 
<b>Learning Goals</b><br><br>
By the end of this workshop you will be able to:
<ul>
<li>Combine data from multiple tables using different types of JOINs (INNER, LEFT, SELF).</li>
<li>Understand the role of primary and foreign keys in establishing table relationships.</li>
<li>Write and use subqueries to break down complex queries with multiple logical steps.</li>
<li>Simplify complex queries using Common Table Expressions (CTEs).</li>
<li>Transform data between row and column orientations with pivoting and unpivoting techniques.</li>
<li>Apply window functions to perform calculations across specified sets of rows.</li>
</ul>
</div>

In [16]:
# Here are some packages that we will need:

from IPython.display import SVG
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

<a id='introduction'></a>
## 1 ¬∑ Introduction 

Estimated Time: 5 minutes

In the last workshop we covered many different operations one can perform in a given table. However, going back to the idea of Relational Databases, we often won't have all of the information we need on a single table, and we will need to find a way of cross-referencing the information from two (or more) different tables together. This processing is called "Joining", and it is an essential aspect of querying with SQL. 

Another common procedure is to first modify the data, and then perform some operations in the modified data. This is what Subqueries are used for - they allow us to quickly reference a modified version of the dataset we are querying, or compare information between two tables without joining them. Common Table Expressions are a way of doing many subqueries simultaneously, or very complex subqueries, while keeping things readable and organized.

Lastly, we will cover a class of operations called Window Functions, which are some of the most powerful tools in SQL. Instead of performing the same function to all rows, they allow the functions to only be applied to *windows*, which are a subset of the observations that are related in a prespecified way. This allows us to calculate summary statistics similar to what we did using ` GROUP BY `, but still retain the original disaggregated information.

üìù **Poll 1:** How confident do you feel about everything we covered in Part 1 (basic SELECT / JOIN / GROUP BY)?

<a id='joins'></a>
## 2 ¬∑ Relational¬†Joins 

Estimated Time: 35 minutes


**Purpose:** ```JOINs``` allow us to combine information from multiple different tables into one. When used with Querying, this also provides a way of retaining only the information required for a particular analysis into a single, organized table, even if originally this information was spread out  

**Example:** Say that we have two tables, one recording the information about Managers, and another one with the information about Employees. Each employee produces a certain amount of revenue to the firm, but a higher-up is interested in understanding what Manager had direct employees that produce the most revenue. 

If we had a table that listed each manager, their respective employees and how much they earned, we could use ```SUM``` + ```GROUP BY``` to quickly do this analysis. But we don't - the information is stored in two separate tables. This is exactly the context of `JOIN`s - creating a new table combining the information from two (or more) other tables. Here is a quick diagram to understand what is happening:

![Entity Relationship diagram linking Employees, Departments and Managers tables with Primary and Foreign Key arrows to show one-to-many relationships.](../Images/database-relationship-diagram2.svg)
---

Notice that in this example, employee_id would be the *primary key* of each table - a unique identifier for each row - while the column "report_to" on the Employees table serves as a *foreign key* - it serves as a reference to values on the table Managers which can be used to cross-reference information.

Notice also that we didn't keep all of the information from each table in the end result. By querying the table after joining, we can decide what to retain, and even perform operations or filtering directly! This again illustrates the principle we laid out at the beginning - SQL is a tool capable of preparing large amounts of data to be analyzed with libraries such as pandas.

In [17]:
# Using the unified dataset for JOIN examples
# First, ensure we have both customers and income tables loaded
print("Tables available in database:\n")
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print([table[0] for table in cursor.fetchall()])

# Basic JOIN example - customers with their income
join_query = """
SELECT 
    c.name AS customer_name,
    c.city,
    c.items_purchased * c.price_per_item AS total_spent,
    i.income_source,
    i.amount AS income_amount
FROM 
    customers c
JOIN 
    income i ON c.name = i.name
WHERE 
    c.items_purchased IS NOT NULL 
    AND c.price_per_item IS NOT NULL
ORDER BY 
    c.name, i.income_source
LIMIT 10;
"""

print("\n JOIN Example - Customers with Income: \n")
result = pd.read_sql_query(join_query, conn)
print(result)

Tables available in database:

['customers', 'income', 'demo_customers', 'demo_orders']

 JOIN Example - Customers with Income:

    customer_name       city  total_spent income_source  income_amount
0    Ahmed Hassan     Sydney       177.45    Consulting         1500.0
1    Ahmed Hassan     Sydney       177.45        Rental          800.0
2    Ahmed Hassan     Sydney       177.45        Salary         3500.0
3  Diego Martinez  Amsterdam        13.09        Salary         2700.0
4     Elena Popov     Madrid        56.37       Pension         1800.0
5   Lars Andersen       None       125.88        Salary         4500.0
6          Li Wei      Tokyo       155.98    Investment          200.0
7          Li Wei      Tokyo       155.98        Salary            NaN
8   Mary Williams       None      1183.71     Part-time         1200.0
9   Sarah Johnson     Berlin       301.15        Salary            NaN

Let's Break down exactly what is happening as we join tables using the example below::


```sql
SELECT 
    m.name AS "Manager Name",
    e.name AS "Employee Name",
    e.revenue AS "Revenue"
FROM 
    Managers m 
JOIN 
    Employees e 
ON 
    m.employee_id = e.reports_to
ORDER BY
    m.name, e.name
```

Let's start from the inside out:
- The first operation being performed is "FROM". This is telling us which Table we will be using as our "main" table - which in SQL is usually referred to as the Left Table. It is useful to think of any JOIN operation as acting "to the right" of this table.
    - Notice that we include a "m" right next to the name of the table we are importing - this is what we call an alias. While this is not necessary for a simple JOIN statement like this, it help keep the query clean and organized. And, as we will see later on, it is necessary for more advanced JOIN statements (such as self-joins).
- The second operation being performed is "JOIN". This is essentially telling SQL to consider a table that is a combination of the Left and Right tables.
    - One very important aspect is that we must tell SQL how to merge these two tables - which is what we do by using the ON statement.
    - In more advanced queries, ON statements can use very complex conditions, including compound ones using logical operators such as AND/OR/NOT, but for now we are just saying "I want a row that combines the information from the two tables whenever the column "employeed_id" on the Manager table matches the "reports_to" column on the Employees table.
    - Notice that we had to specify which table each column came from here - and we can already see why aliases can come in handy.
    - A very important thing to notice is that, if there are multiple matches to the condition on the ON statement, any rows that satisfy it will be joined. This is what happened in our example - there are two rows in the Merged table that have Bob as the Manager Name, since he had two employees that reported to him.
    - Another important thing to know is that, in a basic JOIN statement, any rows that go unmatched are not included in the final result. We will see how more advanced JOIN statements - such as LEFT JOIN - allow us to bypass this.
- We then go to our SELECT statement. As before, this is just telling SQL which information we actually want it to retrieve for us. But, since the information now might come from more than one source, we again need to specify from which table each column is coming from.
- The rest of the statements is similar to a basic Query - we can filter, order, limit/offset, etc - just like we did in the previous workshop


![Flow diagram with FROM, JOIN, WHERE, SELECT and ORDER BY blocks connected by arrows to show query processing order.](../Images/sql-query-flow.svg)
---

üèãÔ∏è‚Äç‚ôÇÔ∏è **Challenge:** Your First Real JOIN 

Individuall, the tables "customers" tells us who our clients are and "orders" tells us what they bought and when.

Task: Using a single JOIN, produce a table that answers
‚ÄúWhich orders were placed by which customer, in what country?‚Äù

```sql
-- Fill in the JOIN condition
SELECT
       o.order_id,
       o.order_date,
       c.name,
       c.country
FROM   orders    AS o
JOIN   customers AS c
       ON  _____________          
ORDER  BY o.order_date;
```

‚ö†Ô∏è **Warning:** Always make sure that your joining condition is present and accurate. Otherwise SQL will perform what we call a Cartesian Product - making every possible combination between the rows - which can become huge really fast.

In [18]:
# Example showing cartesian product vs correct join
# Using our existing customers and income tables

# Cartesian product (WRONG - no join condition)
cartesian_query = """
SELECT COUNT(*) as row_count
FROM customers, income;
"""
cartesian_result = pd.read_sql_query(cartesian_query, conn)

# Correct join
correct_join_query = """
SELECT COUNT(*) as row_count
FROM customers c
JOIN income i ON c.name = i.name;
"""
correct_result = pd.read_sql_query(correct_join_query, conn)

# Get actual counts
customer_count = pd.read_sql_query("SELECT COUNT(*) as count FROM customers", conn).iloc[0,0]
income_count = pd.read_sql_query("SELECT COUNT(*) as count FROM income", conn).iloc[0,0]

print("Cartesian Product Demonstration:\n")
print(f"Number of customers: {customer_count}")
print(f"Number of income records: {income_count}")
print(f"Cartesian product rows (WRONG): {cartesian_result.iloc[0,0]} ({customer_count} √ó {income_count} = every possible combination) \n")
print(f"Correct JOIN rows: {correct_result.iloc[0,0]} (only matching names)\n")

# Show a sample of what cartesian product looks like
cartesian_detail = """
SELECT c.name, c.city, i.income_source, i.amount
FROM customers c, income i
LIMIT 10;
"""
print(pd.read_sql_query(cartesian_detail, conn))

Cartesian Product Demonstration:

Number of customers: 25
Number of income records: 22
Cartesian product rows (WRONG): 550 (25 √ó 22 = every possible combination)

Correct JOIN rows: 16 (only matching names)

         name      city income_source  amount
0  John Smith  New York        Salary  3000.0
1  John Smith  New York     Freelance   500.0
2  John Smith  New York        Salary  2500.0
3  John Smith  New York         Bonus  1000.0
4  John Smith  New York        Salary     NaN
5  John Smith  New York    Investment   200.0
6  John Smith  New York        Salary  3500.0
7  John Smith  New York    Consulting  1500.0
8  John Smith  New York        Rental   800.0
9  John Smith  New York        Salary     NaN

‚ö†Ô∏è **Warning:** Always verify your JOIN produces the expected number of rows! A missing or incorrect JOIN condition can create a Cartesian product, multiplying your data exponentially. For example, joining two 1,000-row tables without proper conditions creates 1,000,000 rows! Always check row counts after JOINs.

## 2.1¬†`ON` versus `USING`
While the ON clause is extremely flexible, if the two tables share a column, we can use the simpler USING() method.

‚ö†Ô∏è  **Warning:** When using "USING" to JOIN tables, always make sure that the names are identical in both tables.

In [19]:
# USING clause with a subquery that creates matching column names
# Create a subquery that has a 'name' column matching customers table
using_join_query = """
SELECT 
    c.name,
    c.city,
    c.account_balance,
    i.total_income
FROM 
    customers c
JOIN 
    (SELECT name, SUM(amount) AS total_income 
     FROM income 
     GROUP BY name) i
USING (name)
WHERE 
    c.account_balance IS NOT NULL
ORDER BY 
    total_income DESC
LIMIT 10;
"""

print("JOIN with USING clause:\n")
print(pd.read_sql_query(using_join_query, conn))

# Compare with ON clause - same results, different syntax
on_join_query = """
SELECT 
    c.name,
    c.city,
    c.account_balance,
    i.total_income
FROM 
    customers c
JOIN 
    (SELECT name, SUM(amount) AS total_income 
     FROM income 
     GROUP BY name) i
ON c.name = i.name
WHERE 
    c.account_balance IS NOT NULL
ORDER BY 
    total_income DESC
LIMIT 10;
"""

print("\n Same query with ON clause (identical results):\n")
print(pd.read_sql_query(on_join_query, conn))

JOIN with USING clause:

             name       city  account_balance  total_income
0    Ahmed Hassan     Sydney           179.64        5800.0
1   Lars Andersen       None           588.43        4500.0
2      John Smith   New York           945.55        3500.0
3    Maria Garcia     London           905.34        3500.0
4     Yuki Tanaka   Shanghai           344.21        3200.0
5  Diego Martinez  Amsterdam           821.98        2700.0
6     Elena Popov     Madrid           845.86        1800.0
7   Mary Williams       None           795.02        1200.0
8          Li Wei      Tokyo           638.11         200.0

 Same query with ON clause (identical results):

             name       city  account_balance  total_income
0    Ahmed Hassan     Sydney           179.64        5800.0
1   Lars Andersen       None           588.43        4500.0
2      John Smith   New York           945.55        3500.0
3    Maria Garcia     London           905.34        3500.0
4     Yuki Tanaka   Shanghai           344.21        3200.0
5  Diego Martinez  Amsterdam           821.98        2700.0
6     Elena Popov     Madrid           845.86        1800.0
7   Mary Williams       None           795.02        1200.0
8          Li Wei      Tokyo           638.11         200.0

‚ö†Ô∏è Warning: Common Mistake - Ambiguous column names in JOINs

```sql
-- ‚ùå WRONG: Unclear which table's 'name' column
SELECT name, amount
FROM customers
JOIN income ON customers.name = income.name

-- ‚úÖ CORRECT: Qualify columns with table names or aliases
SELECT c.name, i.amount
FROM customers c
JOIN income i ON c.name = i.name
```

But is important to be careful - using a non-primary key column can lead to issues

In [20]:
problematic_using_join = """
SELECT
    c.name,
    c.city,
    c.items_purchased * c.price_per_item AS total_spent,
    i.amount
FROM   customers AS c
INNER JOIN income AS i            -- multiple income rows per customer
USING  (name)                     -- alias *i* is required for i.amount
ORDER  BY c.name
LIMIT  20;
"""

print(
    "\nProblematic USING() JOIN Results:"
)
display(pd.read_sql_query(problematic_using_join, conn))

Problematic USING() JOIN Results:

              name       city  total_spent  amount
0     Ahmed Hassan     Sydney       177.45   800.0
1     Ahmed Hassan     Sydney       177.45  1500.0
2     Ahmed Hassan     Sydney       177.45  3500.0
3   Diego Martinez  Amsterdam        13.09  2700.0
4      Elena Popov     Madrid        56.37  1800.0
5       John Smith   New York          NaN   500.0
6       John Smith   New York          NaN  3000.0
7    Lars Andersen       None       125.88  4500.0
8           Li Wei      Tokyo       155.98     NaN
9           Li Wei      Tokyo       155.98   200.0
10    Maria Garcia     London          NaN  1000.0
11    Maria Garcia     London          NaN  2500.0
12   Mary Williams       None      1183.71  1200.0
13   Sarah Johnson     Berlin       301.15     NaN
14   Sarah Johnson     Berlin       301.15   400.0
15     Yuki Tanaka   Shanghai       299.36  3200.0

üîî **Question:** Can anyone figure out what went wrong here?

ü•ä **Challenge:** Join customers with income to list each customer‚Äôs name, country, and total income (sum of amount) sorted by total income descending.

In [15]:
# Debug this intentional error

bad_query = """
SELECT name, country, SUM(amount) AS total_income
FROM customers
JOIN income
  ON name = name          -- ‚ùå ambiguous columns!
GROUP BY name, country
ORDER BY total_income DESC;
"""
pd.read_sql_query(bad_query, conn)

DatabaseError: Execution failed on sql '
SELECT name, country, SUM(amount) AS total_income
FROM customers
JOIN income
  ON name = name          -- ‚ùå ambiguous columns!
GROUP BY name, country
ORDER BY total_income DESC;
': ambiguous column name: name

## 2.2¬†Multiple¬†Joins - Advanced Topic, Time Permitting üï§
We don't have to stop at two - we can use multiple joins at once. And what is interesting is that we can get pretty creative with the ON conditions.

In [21]:
multi_join_query = """
SELECT
    c.name,
    c.country,
    c.items_purchased * c.price_per_item AS total_spent,

    /* total income per customer, pre-aggregated in an inline view */
    it.total_income,

    /* country-level average balance for extra JOIN practice */
    cs.avg_balance

FROM   customers AS c

/* 1) Join to per-customer income totals */
LEFT JOIN (
    SELECT name,
           SUM(amount) AS total_income
    FROM   income
    GROUP  BY name
) AS it
  ON c.name = it.name

/* 2) Join to per-country balance stats */
LEFT JOIN (
    SELECT country,
           AVG(account_balance) AS avg_balance
    FROM   customers
    WHERE  account_balance IS NOT NULL
    GROUP  BY country
) AS cs
  ON c.country = cs.country

ORDER BY it.total_income DESC
"""

print("\nMulti-join demonstration ‚Äì customers plus derived totals:\n")
print(pd.read_sql_query(multi_join_query, conn))

Multi-join demonstration ‚Äì customers plus derived totals:

                name country  total_spent  total_income  avg_balance
0       Ahmed Hassan      AU       177.45        5800.0       179.64
1      Lars Andersen    None       125.88        4500.0          NaN
2         John Smith      US          NaN        3500.0       945.55
3       Maria Garcia      GB          NaN        3500.0       905.34
4        Yuki Tanaka      CN       299.36        3200.0       344.21
5     Diego Martinez      NL        13.09        2700.0       821.98
6        Elena Popov      ES        56.37        1800.0       845.86
7      Mary Williams    None      1183.71        1200.0          NaN
8      Sarah Johnson      DE       301.15         400.0          NaN
9             Li Wei      JP       155.98         200.0       638.11
10        Emma Brown      FR       517.44           NaN       929.69
11  Carlos Rodriguez      IN      1049.40           NaN       140.70
12     Anna Kowalski      BR      1066.01           NaN       392.80
13      James Wilson      CA       331.04           NaN       449.81
14     Michel Dubois      RU       143.16           NaN       421.08
15      Sofia Santos      AE       595.32           NaN       352.84
16       Aisha Patel      MX       109.14           NaN       226.83
17         Lucy Chen      EG      1102.08           NaN       167.10
18       Ivan Petrov      SE       399.48           NaN       988.20
19         Raj Kumar      US       380.50           NaN       945.55
20      Hans Schmidt      IT          NaN           NaN       104.97
21    Isabella Silva      HK       888.00           NaN       833.92
22    Fatima Al-Said      TR          NaN           NaN       736.17
23          Jun Park      KR      1847.94           NaN       756.11
24      Anna Ivanova      TH       957.12           NaN       794.14

üîî **Question:** In the results above, notice how some customers have NULL values for `total_income` while others have NULL for `total_spent`. Why is this happening?

This demonstrates the difference between ```INNER JOIN``` and ```LEFT JOIN```.

If we had used ```INNER JOIN``` for both joins, we would only see customers who have entries in ALL three tables. But the query above uses ```LEFT JOIN```, which preserves all rows from the left table (customers) even when there's no match in the joined tables.

Looking at our results:
- Emma Brown, Carlos Rodriguez, and others have `total_spent` values but NULL for `total_income` - they made purchases but have no income records
- Hans Schmidt and Fatima Al-Said have NULL for both - they're in the customers table but have neither purchase nor income data
- The first 10 customers have values for both - they exist in all three derived tables

This flexibility of ```LEFT JOIN``` is exactly why it's so useful - it helps us identify missing data relationships while still showing all our customers.

In this workshop we will explore both ```INNER JOIN``` (which we saw in the basic example) and ```LEFT JOIN``` in detail, along with ```SELF JOIN``` - but for those curious, there are others, such as ```RIGHT JOIN```, ```FULL JOIN``` AND ```CROSS JOIN```.

üìù **Poll 2:** You want *all* customers, even those with no orders. Which join keeps them? 
- customers `LEFT JOIN` orders
- orders `LEFT JOIN` customers
- Either order gives same result
- Neither command would return all customers

## 2.3¬†Advanced Join Variants
- **LEFT JOIN**: retains all rows from the left table.
    - This is why it is important to distinguish which table is being used in the FROM statement, and which is being brought by the JOIN statement
    - Specially useful to handle missing data 
- **SELF¬†JOIN**: the table is joined to itself
    - We essentially deal with two tables - one of them being a duplicate of the first - and then JOIN them
    - Very useful as a filtering tool

üîî **Question:** Can anyone think of an example in which we might want to join a table with itself?

![Set-logic Venn diagrams for LEFT, INNER and FULL joins with tiny code snippets and labelled A/B table overlaps.](../Images/sql-joins-venn-diagram.svg)
---

Let's understand what is going on with the different type of joins:
- In a ```LEFT JOIN```, we start with all rows from table 1 - the "left" table. If there is a match in table 2, bring the extra columns, otherwise leave these columns ```NULL```
- In a ```INNER JOIN```, we only keep the records that are on both tables! In other words, if one row is in one table but not the other, do not bring it to the merged table.
- For a ```FULL JOIN```, we treat both tables as the "left" one - we keep every row from both sides, and if it does not have a matching record, fill the gaps with ```NULL```

üôã **Hands-Up:** True or False ‚Äî `INNER JOIN` can drop rows that exist in only one table.

### üèãÔ∏è‚Äç‚ôÇÔ∏è Challenge ‚Äî Why `LEFT JOIN` Order Matters

`customers` lists everyone in our sample.  
`income` records dollar amounts **only for those customers who reported income**.

1. **Write two queries**  
   * **Query A**: `customers  LEFT JOIN income`  
   * **Query B**: `income     LEFT JOIN customers`
2. For each query return just one column: `COUNT(*) AS row_count`.
3. Compare the two row counts‚Äîexplain the difference in one sentence *(code comment is fine)*.

> **Hint**  
> In a `LEFT JOIN`, **all** rows from the table **before** `LEFT JOIN` are preserved, even when no match exists in the table **after** `LEFT JOIN`.

In [22]:
qA = """SELECT COUNT(*) AS n FROM customers
        LEFT JOIN income ON customers.name = income.name"""
qB = """SELECT COUNT(*) AS n FROM income
        LEFT JOIN customers ON customers.name = income.name"""
nA = pd.read_sql_query(qA, conn)["n"][0]
nB = pd.read_sql_query(qB, conn)["n"][0]

assert nA >= nB, textwrap.dedent(f"""
    Expected Query A (customers left) to have ‚â• rows than Query B,
    but got {nA} vs {nB}.
""")
print(f"‚úî Query A rows: {nA}  |  Query B rows: {nB} ‚Äî order matters!")

‚úî Query A rows: 31  |  Query B rows: 22 ‚Äî order matters!

One consideration when using ```LEFT JOIN``` is that it returns ```NULL``` values for unmatched records - but we might want to handle these NULLs differently depending on our analysis needs. 

For example, in our data:
- When Li Wei has a NULL amount in some income records, it means the income amount is unknown
- When Emma Brown has NULL for total_income after our JOIN, it means she has no income records at all

Sometimes we want to treat these NULLs as zeros (e.g., "no income records" = "0 total income" for a spending analysis), while other times we want to preserve them as unknown values.

Luckily, SQL includes a function that allows us to tailor the behavior of ```NULL``` entries for a given query - the ```COALESCE``` command. The first argument of the function tells us which column to analyze, and the second entry what to replace ```NULL``` values by. Let's take a look at an example in practice.

In [23]:
# LEFT JOIN without COALESCE ‚Äì observe the NULL "amount" rows
no_coalesce_query = """
SELECT
    c.name,
    c.country,
    i.amount            -- will be NULL if the customer has no income rows
FROM   customers AS c
LEFT JOIN income AS i
       ON c.name = i.name
ORDER  BY c.name
LIMIT  20;
"""
print(pd.read_sql_query(no_coalesce_query, conn))

                name country  amount
0       Ahmed Hassan      AU   800.0
1       Ahmed Hassan      AU  1500.0
2       Ahmed Hassan      AU  3500.0
3        Aisha Patel      MX     NaN
4       Anna Ivanova      TH     NaN
5      Anna Kowalski      BR     NaN
6   Carlos Rodriguez      IN     NaN
7     Diego Martinez      NL  2700.0
8        Elena Popov      ES  1800.0
9         Emma Brown      FR     NaN
10    Fatima Al-Said      TR     NaN
11      Hans Schmidt      IT     NaN
12    Isabella Silva      HK     NaN
13       Ivan Petrov      SE     NaN
14      James Wilson      CA     NaN
15        John Smith      US   500.0
16        John Smith      US  3000.0
17          Jun Park      KR     NaN
18     Lars Andersen    None  4500.0
19            Li Wei      JP     NaN

In [24]:
# Same JOIN, but fill the missing income amounts with 0
coalesce_query = """
SELECT
    c.name,
    c.country,
    COALESCE(i.amount, 0) AS amount_received   -- replaces NULL with 0
FROM   customers AS c
LEFT JOIN income AS i
       ON c.name = i.name
ORDER  BY c.name
LIMIT  20;
"""
print(pd.read_sql_query(coalesce_query, conn))

                name country  amount_received
0       Ahmed Hassan      AU            800.0
1       Ahmed Hassan      AU           1500.0
2       Ahmed Hassan      AU           3500.0
3        Aisha Patel      MX              0.0
4       Anna Ivanova      TH              0.0
5      Anna Kowalski      BR              0.0
6   Carlos Rodriguez      IN              0.0
7     Diego Martinez      NL           2700.0
8        Elena Popov      ES           1800.0
9         Emma Brown      FR              0.0
10    Fatima Al-Said      TR              0.0
11      Hans Schmidt      IT              0.0
12    Isabella Silva      HK              0.0
13       Ivan Petrov      SE              0.0
14      James Wilson      CA              0.0
15        John Smith      US            500.0
16        John Smith      US           3000.0
17          Jun Park      KR              0.0
18     Lars Andersen    None           4500.0
19            Li Wei      JP              0.0

### SELF JOIN - Advanced Topic, Time Permitting üï§

Now let's talk a bit about SELF JOIN. As we mentioned before, the idea here is to join a table with itself. This is one of the cases in which using aliases is extremely important, since, by construction, both of the tables will have all columns in common!

Let's see an example on how this might work in practice.

In [25]:
# A self-join example: customers with similar spending levels
spending_similarity_query = """
SELECT 
    c1.name AS customer_1,
    c2.name AS customer_2,
    c1.items_purchased * c1.price_per_item AS customer_1_spent,
    c2.items_purchased * c2.price_per_item AS customer_2_spent,
    ABS((c1.items_purchased * c1.price_per_item) - 
        (c2.items_purchased * c2.price_per_item)) AS spending_difference
FROM 
    customers c1
JOIN 
    customers c2 ON c1.name < c2.name
WHERE 
    c1.items_purchased IS NOT NULL 
    AND c1.price_per_item IS NOT NULL
    AND c2.items_purchased IS NOT NULL 
    AND c2.price_per_item IS NOT NULL
    AND ABS((c1.items_purchased * c1.price_per_item) - 
            (c2.items_purchased * c2.price_per_item)) < 50
ORDER BY 
    spending_difference;
"""

print("Customers with Similar Spending (within $50):\n")
print(pd.read_sql_query(spending_similarity_query, conn))

Customers with Similar Spending (within $50):

        customer_1        customer_2  customer_1_spent  customer_2_spent  \
0    Sarah Johnson       Yuki Tanaka            301.15            299.36
1           Li Wei     Michel Dubois            155.98            143.16
2    Anna Kowalski  Carlos Rodriguez           1066.01           1049.40
3      Aisha Patel     Lars Andersen            109.14            125.88
4    Lars Andersen     Michel Dubois            125.88            143.16
5      Ivan Petrov         Raj Kumar            399.48            380.50
6     Ahmed Hassan            Li Wei            177.45            155.98
7     James Wilson     Sarah Johnson            331.04            301.15
8    Lars Andersen            Li Wei            125.88            155.98
9     James Wilson       Yuki Tanaka            331.04            299.36
10     Aisha Patel     Michel Dubois            109.14            143.16
11    Ahmed Hassan     Michel Dubois            177.45            143.16
12   Anna Kowalski         Lucy Chen           1066.01           1102.08
13  Diego Martinez       Elena Popov             13.09             56.37
14     Aisha Patel            Li Wei            109.14            155.98
15    James Wilson         Raj Kumar            331.04            380.50

    spending_difference
0                  1.79
1                 12.82
2                 16.61
3                 16.74
4                 17.28
5                 18.98
6                 21.47
7                 29.89
8                 30.10
9                 31.68
10                34.02
11                34.29
12                36.07
13                43.28
14                46.84
15                49.46

There are a few things worth noticing here:
- When we selected the columns from each table, it was important to rename them - since they had the same original names!
- Notice that John did not report to anyone - so he was not included as an employee in the merged table. This could be adapted by using a LEFT JOIN
- Some managers appear many times, since more than one employee reports to them.

### üèãÔ∏è‚Äç‚ôÇÔ∏è Challenge ‚Äî Customers Who Out-Spend Everyone Else in Their Country
‚ÄúWho is the top spender in each country?‚Äù

Idea:
Self-JOIN customers to itself on country.
For each row c1, look for a matching row c2 in the same country whose total_spent is higher.
If no such c2 exists, c1 must be that country‚Äôs top spender.

In [26]:
top_spenders_query = """
-- 1) Build total spending per customer
WITH customer_spending AS (
    SELECT
           name,
           country,
           items_purchased * price_per_item AS total_spent
    FROM   customers
    WHERE  items_purchased IS NOT NULL
       AND price_per_item  IS NOT NULL
)

-- 2) Self-JOIN filter: keep only rows with no higher spender in the same country
SELECT
       c1.name,
       c1.country,
       c1.total_spent
FROM   customer_spending AS c1
LEFT JOIN customer_spending AS c2
       ON  c1.country      = c2.country
       AND c2.total_spent  > c1.total_spent
WHERE  c2.name IS NULL              -- ‚Üê nobody beats c1 in that country
ORDER  BY c1.country, c1.total_spent DESC;
"""
pd.read_sql_query(top_spenders_query, conn)

                name country  total_spent
0      Mary Williams    None      1183.71
1      Lars Andersen    None       125.88
2       Sofia Santos      AE       595.32
3       Ahmed Hassan      AU       177.45
4      Anna Kowalski      BR      1066.01
5       James Wilson      CA       331.04
6        Yuki Tanaka      CN       299.36
7      Sarah Johnson      DE       301.15
8          Lucy Chen      EG      1102.08
9        Elena Popov      ES        56.37
10        Emma Brown      FR       517.44
11    Isabella Silva      HK       888.00
12  Carlos Rodriguez      IN      1049.40
13            Li Wei      JP       155.98
14          Jun Park      KR      1847.94
15       Aisha Patel      MX       109.14
16    Diego Martinez      NL        13.09
17     Michel Dubois      RU       143.16
18       Ivan Petrov      SE       399.48
19      Anna Ivanova      TH       957.12
20         Raj Kumar      US       380.50

Of course, SELF JOINs can be used for purposes other than filtering. Another classic application is to find pairs that satisfy some criterion

In [27]:
self_join_query = """
SELECT 
    c1.name AS customer_1,
    c2.name AS customer_2,
    c1.city AS shared_city,
    c1.country
FROM 
    customers c1
JOIN 
    customers c2 ON c1.city = c2.city 
                 AND c1.name < c2.name  -- Avoid duplicates and self-matches
WHERE 
    c1.city IS NOT NULL
ORDER BY 
    c1.city, c1.name;
"""

print("SELF JOIN Example - Customers from the Same City:")
result = pd.read_sql_query(self_join_query, conn)
print(result)

SELF JOIN Example - Customers from the Same City:
Empty DataFrame
Columns: [customer_1, customer_2, shared_city, country]
Index: []

üìù **Poll 3:** When self-joining `customers` to find same-country pairs, what extra condition avoids duplicate & mirror rows? - `c1.id <> c2.id` - `c1.id < c2.id` - `c1.country IS NOT NULL`

<a id='subqueries'></a>
## 3¬†¬∑¬†Subqueries 

Estimated Time: 20 minutes

**Definition.** As the name says, a subquery is a query contained in another query. This allows us to perform auxiliary queries, and then use the results of these queries in our main query. Unlike the main query, subqueries are temporary - they only exist while the instance of the query is being worked out. 

**Purpose.** Subqueries are very useful when one needs to break down a complex question into multiple manageable individual parts.For example, one might want to summarize or filter a given table, and use the summarized/filtered results as the input of another query. 

**Common Use¬†Case.** Getting summary statistics for each individual, while keeping information unrelated from the variable we are using to aggregate.

In [28]:
# Total income per person, then attach all customer metadata
income_totals_query = """
SELECT
    c.name,
    c.city,
    c.country,
    it.total_income
FROM   customers AS c
JOIN  ( SELECT name,
               SUM(amount) AS total_income
        FROM   income
        WHERE  amount IS NOT NULL      -- defensive
        GROUP  BY name ) AS it
      ON c.name = it.name
ORDER BY it.total_income DESC;
"""
print("Customers ranked by total recorded income:")
display(pd.read_sql_query(income_totals_query, conn))

Customers ranked by total recorded income:

             name       city country  total_income
0    Ahmed Hassan     Sydney      AU        5800.0
1   Lars Andersen       None    None        4500.0
2      John Smith   New York      US        3500.0
3    Maria Garcia     London      GB        3500.0
4     Yuki Tanaka   Shanghai      CN        3200.0
5  Diego Martinez  Amsterdam      NL        2700.0
6     Elena Popov     Madrid      ES        1800.0
7   Mary Williams       None    None        1200.0
8   Sarah Johnson     Berlin      DE         400.0
9          Li Wei      Tokyo      JP         200.0

There are two main ways of using subqueries:

1) To Filter results.

A classic example is to find all customers who spend more than average.

In [29]:
# Subquery example - Find customers who spend more than average
subquery_example = """
WITH spending_stats AS (
    SELECT 
        AVG(items_purchased * price_per_item) AS avg_spent,
        MAX(items_purchased * price_per_item) AS max_spent,
        MIN(items_purchased * price_per_item) AS min_spent
    FROM customers
    WHERE items_purchased IS NOT NULL 
      AND price_per_item IS NOT NULL
)
SELECT 
    c.name,
    c.city,
    c.country,
    c.items_purchased * c.price_per_item AS total_spent,
    ROUND((SELECT avg_spent FROM spending_stats), 2) AS average_spending
FROM 
    customers c
WHERE 
    c.items_purchased IS NOT NULL 
    AND c.price_per_item IS NOT NULL
    AND (c.items_purchased * c.price_per_item) > (
        SELECT avg_spent FROM spending_stats
    )
ORDER BY 
    total_spent DESC;
"""

result = pd.read_sql_query(subquery_example, conn)
print("Customers who spend more than average:\n")
print(result)

avg_spent = pd.read_sql_query("""
    SELECT ROUND(AVG(items_purchased * price_per_item), 2) as avg_spent
    FROM customers
    WHERE items_purchased IS NOT NULL AND price_per_item IS NOT NULL
""", conn).iloc[0,0]
print(f"\n Average spending: ${avg_spent}")

Customers who spend more than average:

               name       city country  total_spent  average_spending
0          Jun Park      Seoul      KR      1847.94            557.12
1     Mary Williams       None    None      1183.71            557.12
2         Lucy Chen      Cairo      EG      1102.08            557.12
3     Anna Kowalski  S√£o Paulo      BR      1066.01            557.12
4  Carlos Rodriguez     Mumbai      IN      1049.40            557.12
5      Anna Ivanova    Bangkok      TH       957.12            557.12
6    Isabella Silva  Hong Kong      HK       888.00            557.12
7      Sofia Santos      Dubai      AE       595.32            557.12

 Average spending: $557.12

‚ö†Ô∏è Warning: Common Mistake - Incorrect subquery references

```sql
-- ‚ùå WRONG: Cannot reference CTE columns directly
WITH high_spenders AS (
    SELECT name, SUM(amount) as total FROM income GROUP BY name
)
SELECT * FROM customers
WHERE account_balance > high_spenders.total

-- ‚úÖ CORRECT: Use subquery or JOIN with CTE
WITH high_spenders AS (
    SELECT name, SUM(amount) as total FROM income GROUP BY name
)
SELECT c.* FROM customers c
JOIN high_spenders h ON c.name = h.name
WHERE c.account_balance > h.total
```

2) As a derived table to query from:

In [30]:
window_query_sqlite = """
SELECT
    name,
    city,
    items_purchased,
    city_avg
FROM (
    SELECT
        name,
        city,
        items_purchased,
        AVG(items_purchased) OVER (PARTITION BY city) AS city_avg
    FROM   customers
    WHERE  items_purchased IS NOT NULL
)
WHERE  items_purchased > city_avg
ORDER  BY city, items_purchased DESC;
"""

display(pd.read_sql_query(window_query_sqlite, conn))

            name  city  items_purchased  city_avg
0  Mary Williams  None             17.0      11.5

As promised in the first workshop, we can also use subqueries in combination with IN to check for membership against entire tables - usually the result of a subquery.

For example, let's say that we want to select the names of all customers who have purchased on Electronic item, but the information between consumers, products and purchases are all on separate tables. We could first JOIN them, then use a WHERE statement to filter them. But this would create a very large merged table. Instead, we can just use an IN statement with a subquery:

In [31]:
# Using IN with subquery to find customers with high income
# First, let's see what income levels we have
income_summary = """
SELECT 
    name,
    SUM(amount) as total_income
FROM income
WHERE amount IS NOT NULL
GROUP BY name
HAVING SUM(amount) > 5000
ORDER BY total_income DESC;
"""
print("High income earners (>$5000):\n")
print(pd.read_sql_query(income_summary, conn))

# Find customer details for high income earners
high_income_customers_query = """
SELECT 
    c.name,
    c.city,
    c.country,
    c.account_balance,
    c.items_purchased * c.price_per_item as total_spent
FROM 
    customers c
WHERE 
    c.name IN (
        SELECT name
        FROM income
        WHERE amount IS NOT NULL
        GROUP BY name
        HAVING SUM(amount) > 5000
    )
    AND c.account_balance IS NOT NULL
ORDER BY 
    c.account_balance DESC;
"""

print("\n Customer details for high income earners: \n")
result = pd.read_sql_query(high_income_customers_query, conn)
print(result)

# Compare with NOT IN - customers without high income
low_income_customers_query = """
SELECT 
    c.name,
    c.city,
    c.account_balance
FROM 
    customers c
WHERE 
    c.name NOT IN (
        SELECT name
        FROM income
        WHERE amount IS NOT NULL
        GROUP BY name
        HAVING SUM(amount) > 5000
    )
    AND c.name IN (SELECT DISTINCT name FROM income)  -- Only those with some income data
    AND c.account_balance IS NOT NULL
ORDER BY 
    c.account_balance DESC
LIMIT 5;
"""

print("\n Customers with income data but earning <= $5000:\n")
print(pd.read_sql_query(low_income_customers_query, conn))

High income earners (>$5000):

           name  total_income
0  Ahmed Hassan        5800.0

 Customer details for high income earners:

           name    city country  account_balance  total_spent
0  Ahmed Hassan  Sydney      AU           179.64       177.45

 Customers with income data but earning <= $5000:

             name       city  account_balance
0      John Smith   New York           945.55
1    Maria Garcia     London           905.34
2     Elena Popov     Madrid           845.86
3  Diego Martinez  Amsterdam           821.98
4   Mary Williams       None           795.02

‚ö†Ô∏è **Warning:** Using NOT IN with subqueries that may contain NULL values can return no results! This is because NULL comparisons are undefined. Use NOT EXISTS or filter out NULLs in your subquery with WHERE column IS NOT NULL to avoid this trap.

ü•ä **Challenge:** List the name, country, and total_income of every customer whose total income is below the overall average customer income.

In [16]:
# Debug this intentional error

bad_query = """
SELECT c.name, c.country, SUM(i.amount) AS total_income
FROM customers AS c
JOIN income AS i
  ON c.name = i.name
GROUP BY c.name, c.country
WHERE SUM(i.amount) <
      ( SELECT AVG(SUM(amount)) FROM income );  -- ‚ùå aggregate inside AVG; also WHERE not HAVING
"""
pd.read_sql_query(bad_query, conn)

DatabaseError: Execution failed on sql '
SELECT c.name, c.country, SUM(i.amount) AS total_income
FROM customers AS c
JOIN income AS i
  ON c.name = i.name
GROUP BY c.name, c.country
WHERE SUM(i.amount) <
      ( SELECT AVG(SUM(amount)) FROM income );  -- ‚ùå aggregate inside AVG; also WHERE not HAVING
': near "WHERE": syntax error

<a id='ctes'></a>
## 4¬†¬∑¬†Common¬†Table¬†Expressions (CTEs) 

Estimated Time: 15 minutes

Subqueries are a great way of breaking down a complex query into smaller, more manageable subparts. But very often these subqueries can become quite long, and given that one must include the full query inside another query, they can become very hard to read. 

CTEs are a way of solving this issue. Instead of rewriting the entire subquery inside the main query, we first give aliases to our subqueries, and then refer to them in the main query.

![Infographic ‚ÄúCTEs vs Subqueries‚Äù showing when to use a readable CTE versus an inline subquery, with tiny code examples.](../Images/ctesubquery.svg)


Basic Syntax   

```sql

WITH cte_name AS (
    SELECT column1, column2, ...
    FROM table
    WHERE condition)
SELECT * 
FROM cte_name;
Key Components
```

WITH clause: Introduces one or more CTEs
cte_name: Gives a name to the temporary result set
Main query: References the CTE like a regular table

üîî **Question:** Would you say that CTEs improve readability? Can you think of an example in which the code is easier to read using subqueries instead?

Multiple CTEs

```sql

WITH cte1 AS (
    SELECT column1 FROM table1
),
cte2 AS (
    SELECT column2 FROM table2
)
SELECT *
FROM cte1
JOIN cte2 ON cte1.column = cte2.column;
```

üí° **Tip:** CTE's can be referenced multiple times in the same query, which improve readability and prevents errors!

üôã **Hands-Up:** Which style feels clearer for multi-step queries so far? A. A nested subquery‚ÄÉB. A CTE (`WITH ‚Ä¶`) above the main query

In [32]:
# CTE example using customers and income data
cte_query = """
WITH customer_spending AS (
    -- Calculate total spending per customer
    SELECT 
        name,
        items_purchased * price_per_item AS total_spent,
        city,
        country
    FROM customers
    WHERE items_purchased IS NOT NULL 
      AND price_per_item IS NOT NULL
),
customer_income AS (
    -- Calculate total income per customer
    SELECT 
        name,
        SUM(amount) AS total_income
    FROM income
    WHERE amount IS NOT NULL
    GROUP BY name
),
spending_analysis AS (
    -- Combine spending and income data
    SELECT 
        cs.name,
        cs.city,
        cs.country,
        cs.total_spent,
        ci.total_income,
        ROUND(cs.total_spent * 100.0 / ci.total_income, 2) AS spending_rate
    FROM customer_spending cs
    JOIN customer_income ci ON cs.name = ci.name
    WHERE ci.total_income > 0
)
-- Final query using the CTEs
SELECT 
    name,
    city,
    country,
    total_spent,
    total_income,
    spending_rate,
    CASE 
        WHEN spending_rate > 50 THEN 'High Spender'
        WHEN spending_rate > 20 THEN 'Moderate Spender'
        ELSE 'Low Spender'
    END AS spending_category
FROM spending_analysis
ORDER BY spending_rate DESC;
"""

‚ö†Ô∏è **Warning:** We cannot reference CTEs directly in a query - this is what we call (lack of) "portability".

```sql
WITH average_data AS (
    SELECT AVG(value) AS avg_value FROM table
)
SELECT *
FROM other_table
WHERE value > average_data.avg_value 
```
Whenever we want to reference a CTE, we must either use a subquery:

```sql
WHERE value > (SELECT avg_value FROM average_data)
```

Or JOIN with the CTE:

```sql
JOIN average_data ON 1=1
WHERE value > average_data.avg_value
```

üí° **Tip:** In this last example, we used a common trick: choose an expression that is always true to add a constant column to the table.

üôã **Hands-Up:** Which keyword starts a Common Table Expression? A. `WITH`‚ÄÉB. `WHERE`‚ÄÉC. `AS`

<a id='pivot'></a>
## 5¬†¬∑¬†Pivoting and Unpivoting (Or Melting) 

Estimated Time: 15 minutes

Pivoting is the process of turning rows into columns, Unpivoting (also called Melting) is the inverse process. 

A common application is when we would like to group information that applies to the same individual. For example, we might have a list of all the different transactions that different clients made, including amount and date. But maybe we would like to understand how purchases vary across the days of the week for each given customer. So we can turn a table from having many rows and three columns, to having one row for each consumer, and 8 columns: one representing the customer name (or any other identification), and one with the transaction amount for that customer on each day of the week. 

üìù **Poll 4:** In data-reshaping lingo, which operation produces a **tall (long-format)** table, and which yields a **wide (spread)** table?

- Melt (gather) ‚Üí tall‚ÄÉ|‚ÄÉPivot (spread) ‚Üí wide  
- Melt (gather) ‚Üí wide‚ÄÉ|‚ÄÉPivot (spread) ‚Üí tall  
- Both operations create tall tables  
- Both operations create wide tables

![Side-by-side pivot vs melt diagram converting wide daily-sales columns into tall name-date-sales rows and back again.](../Images/pivot-melt-diagram.svg)

This is done by using the ```UNION``` (or `UNION ALL`) functions - which are analogues to `JOIN`s, but instead of putting different columns side by side, they combine results from different queries on top of each other. 

The main difference between `UNION` and `UNION ALL` is that the former removes duplicate rows, which increases the computational cost of the function.

Two additional observations:
- The column names will be taken from the first one selected
- All `SELECT` statements must have the same number of columns, and corresponding columns must have the same data types.

In [33]:
# Using the income table for pivot example
print("Original Income Data (first 10 rows):")
income_sample = pd.read_sql_query("SELECT * FROM income LIMIT 10", conn)
print(income_sample)

# Pivot income by day of week
pivot_query = """
SELECT 
    name,
    SUM(CASE WHEN day = 'Monday' THEN amount ELSE 0 END) AS Monday,
    SUM(CASE WHEN day = 'Tuesday' THEN amount ELSE 0 END) AS Tuesday,
    SUM(CASE WHEN day = 'Wednesday' THEN amount ELSE 0 END) AS Wednesday,
    SUM(CASE WHEN day = 'Thursday' THEN amount ELSE 0 END) AS Thursday,
    SUM(CASE WHEN day = 'Friday' THEN amount ELSE 0 END) AS Friday,
    SUM(CASE WHEN day = 'Saturday' THEN amount ELSE 0 END) AS Saturday,
    SUM(amount) AS total_weekly_income
FROM income
WHERE amount IS NOT NULL
GROUP BY name
HAVING total_weekly_income > 0
ORDER BY total_weekly_income DESC;
"""

result = pd.read_sql_query(pivot_query, conn)
print("\\nPivoted Income Data (by day of week):")
print(result)

Original Income Data (first 10 rows):
            name income_source  amount        day
0     John Smith        Salary  3000.0     Monday
1     John Smith     Freelance   500.0     Friday
2   Maria Garcia        Salary  2500.0     Monday
3   Maria Garcia         Bonus  1000.0     Friday
4         Li Wei        Salary     NaN     Monday
5         Li Wei    Investment   200.0  Wednesday
6   Ahmed Hassan        Salary  3500.0     Monday
7   Ahmed Hassan    Consulting  1500.0    Tuesday
8   Ahmed Hassan        Rental   800.0   Thursday
9  Sarah Johnson        Salary     NaN     Monday
\nPivoted Income Data (by day of week):
               name  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  \
0      Ahmed Hassan  3500.0   1500.0        0.0     800.0     0.0       0.0
1     Lars Andersen  4500.0      0.0        0.0       0.0     0.0       0.0
2    Patricia Davis     0.0      0.0     4000.0       0.0     0.0       0.0
3     Robert Taylor  2900.0      0.0        0.0       0.0     0.0     600.0
4      Maria Garcia  2500.0      0.0        0.0       0.0  1000.0       0.0
5        John Smith  3000.0      0.0        0.0       0.0   500.0       0.0
6     Michael Brown  3400.0      0.0        0.0       0.0     0.0       0.0
7       Yuki Tanaka  3200.0      0.0        0.0       0.0     0.0       0.0
8   Jennifer Wilson  3100.0      0.0        0.0       0.0     0.0       0.0
9    Diego Martinez  2700.0      0.0        0.0       0.0     0.0       0.0
10       Amanda Lee     0.0      0.0        0.0    2200.0     0.0       0.0
11      Elena Popov     0.0      0.0        0.0       0.0  1800.0       0.0
12    Mary Williams     0.0   1200.0        0.0       0.0     0.0       0.0
13    Sarah Johnson     0.0      0.0      400.0       0.0     0.0       0.0
14           Li Wei     0.0      0.0      200.0       0.0     0.0       0.0

    total_weekly_income
0                5800.0
1                4500.0
2                4000.0
3                3500.0
4                3500.0
5                3500.0
6                3400.0
7                3200.0
8                3100.0
9                2700.0
10               2200.0
11               1800.0
12               1200.0
13                400.0
14                200.0

Melting, the opposite process, is very useful when we want to do analysis regarding a variable that is not the one determining the rows. For example, say that we have sales data in which each row corresponds to a different product, and different columns represent different years. If we instead want to analyze the expenditure in different years, we can melt the table, and then use grouping or filtering to select a given year.

In [45]:
# First, let's create a pivoted view of income by source
pivoted_income = """
SELECT 
    name,
    SUM(CASE WHEN income_source = 'Salary' THEN amount ELSE 0 END) AS salary_income,
    SUM(CASE WHEN income_source = 'Freelance' THEN amount ELSE 0 END) AS freelance_income,
    SUM(CASE WHEN income_source = 'Investment' THEN amount ELSE 0 END) AS investment_income,
    SUM(CASE WHEN income_source = 'Consulting' THEN amount ELSE 0 END) AS consulting_income
FROM income
WHERE amount IS NOT NULL
GROUP BY name
HAVING (salary_income + freelance_income + investment_income + consulting_income) > 0
LIMIT 5;
"""

print("Pivoted Income Data (Wide Format):\n")
pivoted_df = pd.read_sql_query(pivoted_income, conn)
print(pivoted_df)

# Now melt it back to long format using UNION ALL
melt_query = """
WITH pivoted_data AS (
    SELECT 
        name,
        SUM(CASE WHEN income_source = 'Salary'    THEN amount ELSE 0 END) AS salary_income,
        SUM(CASE WHEN income_source = 'Freelance' THEN amount ELSE 0 END) AS freelance_income,
        SUM(CASE WHEN income_source = 'Investment' THEN amount ELSE 0 END) AS investment_income,
        SUM(CASE WHEN income_source = 'Consulting' THEN amount ELSE 0 END) AS consulting_income
    FROM income
    WHERE amount IS NOT NULL
    GROUP BY name
),
melted AS (
    SELECT name, 'Salary'    AS income_type, salary_income    AS amount FROM pivoted_data WHERE salary_income    > 0
    UNION ALL
    SELECT name, 'Freelance' AS income_type, freelance_income AS amount FROM pivoted_data WHERE freelance_income > 0
    UNION ALL
    SELECT name, 'Investment' AS income_type, investment_income AS amount FROM pivoted_data WHERE investment_income > 0
    UNION ALL
    SELECT name, 'Consulting' AS income_type, consulting_income AS amount FROM pivoted_data WHERE consulting_income > 0
)
SELECT *
FROM   melted
ORDER  BY name, income_type
LIMIT 10;
"""

print("\n Melted Income Data (Long Format):\n")
melted_df = pd.read_sql_query(melt_query, conn)
print(melted_df)

print("\n This demonstrates how UNION ALL can transform wide data back to long format!\n")

Pivoted Income Data (Wide Format):

              name  salary_income  freelance_income  investment_income  \
0     Ahmed Hassan         3500.0               0.0                  0
1       Amanda Lee            0.0            2200.0                  0
2   Diego Martinez         2700.0               0.0                  0
3  Jennifer Wilson         3100.0               0.0                  0
4       John Smith         3000.0             500.0                  0

   consulting_income
0             1500.0
1                0.0
2                0.0
3                0.0
4                0.0

 Melted Income Data (Long Format):

              name income_type  amount
0     Ahmed Hassan  Consulting  1500.0
1     Ahmed Hassan      Salary  3500.0
2       Amanda Lee   Freelance  2200.0
3   Diego Martinez      Salary  2700.0
4  Jennifer Wilson      Salary  3100.0
5       John Smith   Freelance   500.0
6       John Smith      Salary  3000.0
7    Lars Andersen      Salary  4500.0
8           Li Wei  Investment   200.0
9     Maria Garcia      Salary  2500.0

 This demonstrates how UNION ALL can transform wide data back to long format!

<a id='window'></a>
## 6¬†¬∑¬†Window Functions 

Estimated Time: 25 minutes

**Definition.** A window is a subset of the table that is related in some prespecified way, in a very similar way that `GROUP BY` operates - with the crucial difference that it does not collapse the different rows into one, which allows us to preserve information. 

Window Functions operate separately into different windows. Common examples are

- `RANK` - allow us to obtain the rank for different observations inside a given group. For example, we might want to see how much a consumer spent on his first purchase. So we would create a window for each consumer, apply the RANK window function, and then select those that have rank = 1.
- `DENSE_RANK` - Similar to rank, but RANK jumps ranks if there are ties, while DENSE_RANK always has rankings as consecutive numbers. You might have seen this happening in college rankings!
- `ROW_NUMBER()` - returns the row number of each observation. Very useful when the table lacks a primary key.
- `SUM` - when used as a window function, allow us to perform cumulative sums - for example, cumulative sales up to a given date by each salesperson.
- `AVG`/`MAX`/`MIN` - same as their aggregate versions, but allowing to keep information rather than collapsing rows.
- `LAG`/`LEAD` - very useful in the context of time series, allow us to look at the previous/next value of a series.

Basic Syntax: `WINDOW_FUNCTION() OVER (PARTITION BY columns ORDER BY columns)`

Exception: `SUM(column) OVER (PARTITION BY columns)`

üôã **Hands-Up:** Is the difference between a *window function* and an *aggregate function* clear? A. Yes‚ÄÉB. Not yet

![Table annotated with running totals and row numbers to visualize how SUM() OVER and RANK window functions scan partitions.
](../Images/window-function-visualization.svg)
---

### Example 1: ```ROW_NUMBER``` - Rank customers by account balance within each country

Unfortunately, sometimes we work with tables that do not have a primary key. A classic example is one listing many different transactions, including information such as customer, store, amount, method of payment - but no order id. ```ROW_NUMBER``` is a useful window function in this scenario, as it creates an additional column with, as the name suggests, the numbers of each column in the particular ordering the table is in. This works as a "fake" primary key that we can still use to perform operations such as ```JOIN```, even without a true primary key.

‚ö†Ô∏è **Warning:** Forgetting the PARTITION BY clause in window functions will calculate across the entire table, not within groups. This is a common mistake that can lead to incorrect business logic. Always double-check that your window function includes the appropriate PARTITION BY when you need group-wise calculations.

In [35]:

row_number_query = """
SELECT 
    name,
    country,
    account_balance,
    ROW_NUMBER() OVER (PARTITION BY country ORDER BY account_balance DESC) as balance_rank_in_country
FROM customers
WHERE country IS NOT NULL 
  AND account_balance IS NOT NULL
ORDER BY country, balance_rank_in_country
LIMIT 15;
"""
print("1. ROW_NUMBER Example - Customer Rankings by Country:")
print(pd.read_sql_query(row_number_query, conn))

1. ROW_NUMBER Example - Customer Rankings by Country:
                name country  account_balance  balance_rank_in_country
0       Sofia Santos      AE           352.84                        1
1       Ahmed Hassan      AU           179.64                        1
2      Anna Kowalski      BR           392.80                        1
3       James Wilson      CA           449.81                        1
4        Yuki Tanaka      CN           344.21                        1
5          Lucy Chen      EG           167.10                        1
6        Elena Popov      ES           845.86                        1
7         Emma Brown      FR           929.69                        1
8       Maria Garcia      GB           905.34                        1
9     Isabella Silva      HK           833.92                        1
10  Carlos Rodriguez      IN           140.70                        1
11      Hans Schmidt      IT           104.97                        1
12            Li Wei      JP           638.11                        1
13          Jun Park      KR           756.11                        1
14       Aisha Patel      MX           226.83                        1

‚ö†Ô∏è Warning: Common Mistake - Missing PARTITION BY in window functions

```sql
-- ‚ùå WRONG: Ranks ALL rows together, not by group
SELECT name, country, balance,
       RANK() OVER (ORDER BY balance DESC) as rank
FROM customers

-- ‚úÖ CORRECT: Use PARTITION BY to rank within groups
SELECT name, country, balance,
       RANK() OVER (PARTITION BY country ORDER BY balance DESC) as rank
FROM customers
```

### Example 2: Running total - Cumulative spending by purchase date

A very common application in business is to understand not just the spending or revenue in a given day, but the total amount spent/received up to a given date. This is the idea of a cumulative sum - the running total including previous purchases. In SQL, we can use the Window Function versiom of ```SUM``` - which is just like its aggregate function counterpart, but includes the characteristic OVER () component of window functions. This can be used to indicate both how we want to partition the dataset, and how we would like to order the subgroups, since the order matters when calculating cumulative sums!

In [36]:

running_total_query = """
SELECT 
    name,
    last_purchase,
    items_purchased * price_per_item as purchase_amount,
    SUM(items_purchased * price_per_item) 
        OVER (ORDER BY last_purchase ROWS UNBOUNDED PRECEDING) as running_total
FROM customers
WHERE last_purchase IS NOT NULL 
  AND items_purchased IS NOT NULL 
  AND price_per_item IS NOT NULL
ORDER BY last_purchase
LIMIT 10;
"""
print("\n2. Running Total Example - Cumulative Spending Over Time:")
print(pd.read_sql_query(running_total_query, conn))

2. Running Total Example - Cumulative Spending Over Time:
            name last_purchase  purchase_amount  running_total
0     Emma Brown    2024-01-28           517.44         517.44
1   James Wilson    2024-02-02           331.04         848.48
2    Ivan Petrov    2024-02-04           399.48        1247.96
3         Li Wei    2024-02-10           155.98        1403.94
4    Yuki Tanaka    2024-02-17           299.36        1703.30
5    Elena Popov    2024-03-02            56.37        1759.67
6  Lars Andersen    2024-04-08           125.88        1885.55
7      Raj Kumar    2024-04-10           380.50        2266.05
8   Ahmed Hassan    2024-05-14           177.45        2443.50
9    Aisha Patel    2024-06-20           109.14        2552.64

### Example 3: AVG with PARTITION BY - Compare to group average

One of the main motivations for the use of window functions is precisely to have an alternative to ```GROUP BY``` that still allow us to retain individual level information. This is very useful when trying to compare each individual element to a group it belongs - for example, compare the customer balance with the average balance for customers in his country. Without window functions, we would need to first aggregate the data using an aggregate function with ```GROUP BY```, and then use ```JOIN``` to make a new table, and then perform the comparison. Window functions allow us to do this directly.

In [37]:
avg_comparison_query = """
SELECT 
    name,
    country,
    account_balance,
    ROUND(AVG(account_balance) OVER (PARTITION BY country), 2) as country_avg_balance,
    ROUND(account_balance - AVG(account_balance) OVER (PARTITION BY country), 2) as diff_from_country_avg
FROM customers
WHERE country IS NOT NULL 
  AND account_balance IS NOT NULL
ORDER BY country, diff_from_country_avg DESC
LIMIT 10;
"""
print("\n 3. Window AVG Example - Customer Balance vs Country Average:")
pd.read_sql_query(avg_comparison_query, conn)

 3. Window AVG Example - Customer Balance vs Country Average:

,name,country,account_balance,country_avg_balance,diff_from_country_avg
0,Sofia Santos,AE,352.84,352.84,0.0
1,Ahmed Hassan,AU,179.64,179.64,0.0
2,Anna Kowalski,BR,392.80,392.80,0.0
3,James Wilson,CA,449.81,449.81,0.0
4,Yuki Tanaka,CN,344.21,344.21,0.0
5,Lucy Chen,EG,167.10,167.10,0.0
6,Elena Popov,ES,845.86,845.86,0.0
7,Emma Brown,FR,929.69,929.69,0.0
8,Maria Garcia,GB,905.34,905.34,0.0
9,Isabella Silva,HK,833.92,833.92,0.0

### Example 4: RANK vs DENSE_RANK - Ranking with ties

Another common example is to obtain the relative rank of observations in a given group. This is an incredibly complex task without window function - one would need to find all the possible groups, use ```WHERE``` commands to isolate them, order them, and then merge all of the isolated groups together. ```RANK``` allows us to perform this operation in a single command. 

One interesting feature of ```RANK``` is that it leaves gaps after ties. This is common procedure in some applications - for example college rankings. However we might want to not allow for these gaps, and just allow for multiple entries at the same rank. This is exactly what ```DENSE_RANK``` does - dense here referring to the fact that there are no gaps in the ranking.

In [38]:

rank_comparison_query = """
WITH income_totals AS (
    SELECT 
        name,
        SUM(amount) as total_income
    FROM income
    WHERE amount IS NOT NULL
    GROUP BY name
)
SELECT 
    name,
    total_income,
    RANK() OVER (ORDER BY total_income DESC) as rank_with_gaps,
    DENSE_RANK() OVER (ORDER BY total_income DESC) as dense_rank_no_gaps
FROM income_totals
ORDER BY total_income DESC
LIMIT 10;
"""
print("\n 4. RANK vs DENSE_RANK Example:")
print(pd.read_sql_query(rank_comparison_query, conn))

 4. RANK vs DENSE_RANK Example:
              name  total_income  rank_with_gaps  dense_rank_no_gaps
0     Ahmed Hassan        5800.0               1                   1
1    Lars Andersen        4500.0               2                   2
2   Patricia Davis        4000.0               3                   3
3       John Smith        3500.0               4                   4
4     Maria Garcia        3500.0               4                   4
5    Robert Taylor        3500.0               4                   4
6    Michael Brown        3400.0               7                   5
7      Yuki Tanaka        3200.0               8                   6
8  Jennifer Wilson        3100.0               9                   7
9   Diego Martinez        2700.0              10                   8

üèãÔ∏è‚Äç‚ôÇÔ∏è Challenge ‚Äî Customers Who Out-Spend Their Country Average
(Window-Function Edition)

In the previous challenge you solved this task with the standard method:
GROUP BY ‚Üí sub-query ‚Üí JOIN.

Now let‚Äôs do the same calculation with a single window function.

Goal: List every customer whose total spending ( items_purchased √ó price_per_item ) is strictly higher than the average spending of customers in the same country.

In [39]:
country_avg_window_sql = """
WITH spending AS (
    SELECT
           name,
           country,
           items_purchased * price_per_item AS total_spent,
           AVG(items_purchased * price_per_item)
                 OVER (PARTITION BY country) AS country_avg
    FROM   customers
    WHERE  items_purchased IS NOT NULL
      AND  price_per_item  IS NOT NULL
)
SELECT *
FROM   spending
WHERE  total_spent > country_avg
ORDER  BY country, total_spent DESC;
"""

df = pd.read_sql_query(country_avg_window_sql, conn)
df

            name country  total_spent  country_avg
0  Mary Williams    None      1183.71      654.795

<div class="alert alert-success">  
    
## Key Points

Estimated Time: 5 minutes

* **JOINs combine tables on matching values** - Use ON or USING to specify the relationship between tables
* **LEFT JOIN preserves all rows from the left table** - Even when there's no match in the right table, making it ideal for finding missing relationships
* **CTEs improve readability** - Use WITH clauses to break complex queries into named, reusable components
* **Window functions maintain row-level detail** - Unlike GROUP BY, they calculate aggregates while keeping all original rows
* **PARTITION BY creates calculation groups** - Similar to GROUP BY but for window functions
* **Subqueries can filter or transform data** - Use them in WHERE clauses for filtering or FROM clauses as derived tables
* **COALESCE handles NULL values gracefully** - Replace NULLs with meaningful defaults in JOINs and calculations
* **Self-JOINs compare rows within the same table** - Essential for finding relationships between records in a single table

</div>